app/controllers/teachers_controller.rb

INSERT INTO "schools" ("name", "city", "state", "website", "lat", "lng", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "teachers" ("encrypted_first_name", "encrypted_last_name", "encrypted_school_name", "encrypted_email", "encrypted_city", "encrypted_state", "encrypted_website", "encrypted_course", "encrypted_snap", "validated", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        # Receive nested hash from field_for in the view
        @school = School.new school_params
        if !@school.save
            redirect_to root_path, alert: "Failed to submit information :("
        end

        @teacher = @school.teachers.build teacher_params
        @teacher.validated = false
        if @teacher.save

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "teachers" SET "validated" = ?, "updated_at" = ? WHERE "teachers"."id" = ?  [["validated", "t"], ["updated_at", "2019-12-03 07:34:46.636242"], ["id", 1]]
---
    def validate
        id = params[:id]
        teacher = Teacher.find_by(:id => id)
        teacher.validated = true
        teacher.save!